# Case Study on ANOVA

In [ ]:
#Importing important libraries

In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [27]:
data=pd.read_csv('Sales_data_zone_wise.csv') #Reading data into python environment

In [28]:
data.head() #displaying the data

       Month  Zone - A  Zone - B  Zone - C  Zone - D
0  Month - 1   1483525   1748451   1523308   2267260
1  Month - 2   1238428   1707421   2212113   1994341
2  Month - 3   1860771   2091194   1282374   1241600
3  Month - 4   1871571   1759617   2290580   2252681
4  Month - 5   1244922   1606010   1818334   1326062

In [29]:
data.isna().sum() #checking for null values

Month       0
Zone - A    0
Zone - B    0
Zone - C    0
Zone - D    0
dtype: int64

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Month     29 non-null     object
 1   Zone - A  29 non-null     int64
 2   Zone - B  29 non-null     int64
 3   Zone - C  29 non-null     int64
 4   Zone - D  29 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.3+ KB

In [31]:
data1=data.drop('Month',axis=1) #dropping the 'Month' column

In [32]:
data1.head()

   Zone - A  Zone - B  Zone - C  Zone - D
0   1483525   1748451   1523308   2267260
1   1238428   1707421   2212113   1994341
2   1860771   2091194   1282374   1241600
3   1871571   1759617   2290580   2252681
4   1244922   1606010   1818334   1326062

# 1.The mean sales generated by each zone

In [33]:
data1.describe()

           Zone - A      Zone - B      Zone - C      Zone - D
count  2.900000e+01  2.900000e+01  2.900000e+01  2.900000e+01
mean   1.540493e+06  1.755560e+06  1.772871e+06  1.842927e+06
std    2.619401e+05  1.683899e+05  3.331937e+05  3.750165e+05
min    1.128185e+06  1.527574e+06  1.237722e+06  1.234311e+06
25%    1.305972e+06  1.606010e+06  1.523308e+06  1.520406e+06
50%    1.534390e+06  1.740365e+06  1.767047e+06  1.854412e+06
75%    1.820196e+06  1.875658e+06  2.098463e+06  2.180416e+06
max    2.004480e+06  2.091194e+06  2.290580e+06  2.364132e+06

### The mean sales generated by Zone - A

In [34]:
mean_A=data1['Zone - A'].mean()
mean_A

1540493.1379310344

### The mean sales generated by Zone - B

In [35]:
mean_B=data1['Zone - B'].mean()
mean_B

1755559.5862068965

### The mean sales generated by Zone - C

In [36]:
mean_C=data1['Zone - C'].mean()
mean_C

1772871.0344827587

### The mean sales generated by Zone - D

In [49]:
mean_D=data1['Zone - D'].mean()
mean_D

1842926.7586206896

# 2.Total sales generated by all the zones for each month.

In [37]:
data['Total Sales'] = data.sum(axis=1) #Adding a new column for monthwise total sales

In [41]:
data.head()

       Month  Zone - A  Zone - B  Zone - C  Zone - D  Total Sales
0  Month - 1   1483525   1748451   1523308   2267260      7022544
1  Month - 2   1238428   1707421   2212113   1994341      7152303
2  Month - 3   1860771   2091194   1282374   1241600      6475939
3  Month - 4   1871571   1759617   2290580   2252681      8174449
4  Month - 5   1244922   1606010   1818334   1326062      5995328

# 3.Check whether all the zones generate the same amount of sales

In [ ]:
#H0:The mean of the amount of sales generated by all the zones are same.
#H1:The means are not same

In [23]:
import scipy.stats as stats

In [50]:
f,p=stats.f_oneway(data['Zone - A'],data['Zone - B'],data['Zone - C'],data['Zone - D'])

In [51]:
print('F-statistic=',f)
print('p-value=',p)

F-statistic= 5.672056106843581
p-value= 0.0011827601694503335

In [52]:
if(p>0.05):
    print('Accept Null Hypothesis')
else:
    print('Reject Null Hypothesis')

Reject Null Hypothesis

Since p <0.05,we reject the null hypoyhesis